###############################################################################
# Created by write_sdc
###############################################################################
current_design DigitalSine
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 5.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sign}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {signB}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[32]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sine_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0060 [get_ports {sign}]
set_load -pin_load 0.0060 [get_ports {signB}]
set_load -pin_load 0.0060 [get_ports {sine_out[32]}]
set_load -pin_load 0.0060 [get_ports {sine_out[31]}]
set_load -pin_load 0.0060 [get_ports {sine_out[30]}]
set_load -pin_load 0.0060 [get_ports {sine_out[29]}]
set_load -pin_load 0.0060 [get_ports {sine_out[28]}]
set_load -pin_load 0.0060 [get_ports {sine_out[27]}]
set_load -pin_load 0.0060 [get_ports {sine_out[26]}]
set_load -pin_load 0.0060 [get_ports {sine_out[25]}]
set_load -pin_load 0.0060 [get_ports {sine_out[24]}]
set_load -pin_load 0.0060 [get_ports {sine_out[23]}]
set_load -pin_load 0.0060 [get_ports {sine_out[22]}]
set_load -pin_load 0.0060 [get_ports {sine_out[21]}]
set_load -pin_load 0.0060 [get_ports {sine_out[20]}]
set_load -pin_load 0.0060 [get_ports {sine_out[19]}]
set_load -pin_load 0.0060 [get_ports {sine_out[18]}]
set_load -pin_load 0.0060 [get_ports {sine_out[17]}]
set_load -pin_load 0.0060 [get_ports {sine_out[16]}]
set_load -pin_load 0.0060 [get_ports {sine_out[15]}]
set_load -pin_load 0.0060 [get_ports {sine_out[14]}]
set_load -pin_load 0.0060 [get_ports {sine_out[13]}]
set_load -pin_load 0.0060 [get_ports {sine_out[12]}]
set_load -pin_load 0.0060 [get_ports {sine_out[11]}]
set_load -pin_load 0.0060 [get_ports {sine_out[10]}]
set_load -pin_load 0.0060 [get_ports {sine_out[9]}]
set_load -pin_load 0.0060 [get_ports {sine_out[8]}]
set_load -pin_load 0.0060 [get_ports {sine_out[7]}]
set_load -pin_load 0.0060 [get_ports {sine_out[6]}]
set_load -pin_load 0.0060 [get_ports {sine_out[5]}]
set_load -pin_load 0.0060 [get_ports {sine_out[4]}]
set_load -pin_load 0.0060 [get_ports {sine_out[3]}]
set_load -pin_load 0.0060 [get_ports {sine_out[2]}]
set_load -pin_load 0.0060 [get_ports {sine_out[1]}]
set_load -pin_load 0.0060 [get_ports {sine_out[0]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
