###############################################################################
# Created by write_sdc
###############################################################################
current_design DigitalSine
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clockone -period 5.0000 -waveform {0.0000 1.0000} [get_ports {clk}]
set_clock_uncertainty 0.2000 [get_ports {clk}]
set_input_delay 2.0000 -rise -max -add_delay [get_ports {clk}]
set_input_delay 2.0000 -fall -max -add_delay [get_ports {clk}]
set_input_delay 2.0000 -rise -max -add_delay [get_ports {rst}]
set_input_delay 2.0000 -fall -max -add_delay [get_ports {rst}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sign}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sign}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {signB}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {signB}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[0]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[0]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[10]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[10]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[11]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[11]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[12]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[12]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[13]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[13]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[14]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[14]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[15]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[15]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[16]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[16]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[17]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[17]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[18]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[18]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[19]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[19]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[1]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[1]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[20]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[20]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[21]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[21]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[22]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[22]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[23]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[23]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[24]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[24]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[25]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[25]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[26]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[26]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[27]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[27]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[28]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[28]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[29]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[29]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[2]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[2]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[30]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[30]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[31]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[31]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[32]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[32]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[3]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[3]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[4]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[4]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[5]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[5]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[6]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[6]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[7]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[7]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[8]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[8]}]
set_output_delay 2.0000 -rise -max -add_delay [get_ports {sine_out[9]}]
set_output_delay 2.0000 -fall -max -add_delay [get_ports {sine_out[9]}]
set_false_path\
    -from [get_ports {rst}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
